In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn import linear_model
from sklearn.metrics import r2_score

import seaborn as sns
import matplotlib.pylab as plt
%matplotlib inline

going to import all 5 data files and attempt to clean them.

In [2]:
Ancestry=pd.read_csv('Unclean Data/Ancestry 1st Response - Unclean.csv')
Age=pd.read_csv('Unclean Data/Average Age - Unclean.csv')
Education=pd.read_csv('Unclean Data/Education - Unclean.csv')
Children=pd.read_csv('Unclean Data/Number of Children ever born - Unclean.csv')
Income=pd.read_csv('Unclean Data/Weekly income - Unclean.csv')

## Clean Ancestry

the goal here is to have a dataframe with a single column, proportion of western european responses

In [3]:
Ancestry = Ancestry.drop(columns="Unnamed: 13")
Ancestry = Ancestry.drop(columns="Unnamed: 14")
Ancestry = Ancestry.drop(Ancestry.index[95])

In [4]:
Ancestry['NewEuropean'] = Ancestry['North-West European'].str.replace(',', '')
Ancestry['NewEuropean'] = Ancestry['NewEuropean'].astype(int)
Ancestry['Total'] = Ancestry['Total'].str.replace(',', '')
Ancestry['Total'] = Ancestry['Total'].astype(int)

In [5]:
Ancestry['Proportion'] = Ancestry['NewEuropean']/Ancestry['Total']

In [6]:
Ancestry=Ancestry.drop(['Oceanian','North-West European','Southern and Eastern European','North African and Middle Eastern','South-East Asian','North-East Asian','Southern and Central Asian','Peoples of the Americas','Sub-Saharan African','Supplementary codes','Not stated','Total','NewEuropean'],axis=1)

In [11]:
Ancestry.drop([93,94],axis=0)

           Name  Proportion
0        Albury    0.561347
1        Auburn    0.102925
2       Ballina    0.580751
3       Balmain    0.473518
4     Bankstown    0.131282
..          ...         ...
88     Wallsend    0.528365
89   Willoughby    0.391508
90  Wollondilly    0.546110
91   Wollongong    0.413896
92        Wyong    0.545358

[93 rows x 2 columns]

In [12]:
Ancestry.to_csv('Clean Data/CleanAncestry.csv')

## Age
the plan here to give us a single average age that very closely approximates to average age, we will approximate 0-9 years as 5, 10-19 as 15, etc and take the average, sum of count*agebracket divided by total

first, commas must be removed from our strings of data then converted to int

update- through research, it seems we can specify commas as equalling thousands in pandas saving a lot of time

after that, i will replace each column with their supertotal (for 0-9 years, 5*0-9years , for 10-19, 15*10-19, etc)

In [13]:
Age=pd.read_csv('Unclean Data/Average Age - Unclean.csv',thousands=',')

In [14]:
Age['0-9 years'] = 5*Age['0-9 years']
Age['10-19 years'] = 15*Age['10-19 years']
Age['20-29 years'] = 25*Age['20-29 years']
Age['30-39 years'] = 35*Age['30-39 years']
Age['40-49 years'] = 45*Age['40-49 years']
Age['50-59 years'] = 55*Age['50-59 years']
Age['60-69 years'] = 65*Age['60-69 years']
Age['70-79 years'] = 75*Age['70-79 years']
Age['80-89 years'] = 85*Age['80-89 years']
Age['90-99 years'] = 95*Age['90-99 years']
Age['100 years and over'] = 105*Age['100 years and over']

In [15]:
Age['supertotal']= Age['0-9 years'] + Age['10-19 years'] + Age['20-29 years'] + Age['30-39 years'] + Age['40-49 years'] + Age['50-59 years'] + Age['60-69 years'] + Age['70-79 years'] + Age['80-89 years'] + Age['90-99 years'] + Age['100 years and over']

In [16]:
Age['Average']= Age['supertotal']/Age['Total']

In [17]:
Age = Age.drop(['0-9 years','10-19 years','20-29 years','30-39 years','40-49 years','50-59 years','60-69 years','70-79 years','80-89 years','90-99 years','100 years and over','Total','supertotal'],axis=1)

In [20]:
Age = Age.drop([93,94],axis=0)

In [22]:
Age

           Name    Average
0        Albury  41.462241
1        Auburn  34.877516
2       Ballina  44.227358
3       Balmain  37.889434
4     Bankstown  36.483350
..          ...        ...
88     Wallsend  39.034127
89   Willoughby  38.551316
90  Wollondilly  40.534859
91   Wollongong  40.575655
92        Wyong  40.529219

[93 rows x 2 columns]

In [23]:
Age.to_csv('Clean Data/AverageAge.csv')

## Education

our education value will be the proportion of the population that has completed high school (year 12)
because we learned of the thousands feature in read csv, this data will be very easy to clean

In [24]:
Education=pd.read_csv('Unclean Data/Education - Unclean.csv',thousands=',')

In [25]:
Education['Proportion']=Education['Year 12 or equivalent']/Education['Total']

In [26]:
Education=Education.drop(['Year 12 or equivalent','Year 11 or equivalent','Year 10 or equivalent','Year 9 or equivalent','Year 8 or below','Did not go to school','Not stated','Not applicable','Total'],axis=1)

In [28]:
Education = Education.drop([93,94],axis=0)

In [29]:
Education

           Name  Proportion
0        Albury    0.306550
1        Auburn    0.490746
2       Ballina    0.379375
3       Balmain    0.620436
4     Bankstown    0.409595
..          ...         ...
88     Wallsend    0.377066
89   Willoughby    0.625696
90  Wollondilly    0.331617
91   Wollongong    0.389358
92        Wyong    0.273068

[93 rows x 2 columns]

In [30]:
Education.to_csv('Clean Data/Education.csv')

## Number of children

Number of children will be cleaned similarly to average age, except we needn't times every amount by the average of their range, just how many children they've had, including no children by 0 (or more simply, excluding no children entirely)

Children['one child'] also does not need to be edited

In [31]:
Children=pd.read_csv('Unclean Data/Number of Children ever born - Unclean.csv',thousands = ',')

In [32]:
Children['Two children']= 2*Children['Two children']
Children['Three children']= 3*Children['Three children']
Children['Four children']= 4*Children['Four children']
Children['Five children']= 5*Children['Five children']
Children['Six children']= 6*Children['Six children']
Children['Seven children']= 7*Children['Seven children']
Children['Eight or more children']= 8*Children['Eight or more children']

In [33]:
Children['Supertotal']=Children['One child']+Children['Two children']+Children['Three children']+Children['Four children']+Children['Five children']+Children['Six children']+Children['Seven children']+Children['Eight or more children']

In [34]:
Children['Average']=Children['Supertotal']/Children['Total']

In [35]:
Children=Children.drop(['No children','One child','Two children','Three children','Four children','Five children','Six children','Seven children','Eight or more children','Total','Supertotal'],axis=1)

In [41]:
Children.drop([93,94,95], axis=0)

           Name   Average
0        Albury  1.957339
1        Auburn  1.503916
2       Ballina  1.780289
3       Balmain  0.916856
4     Bankstown  1.800435
..          ...       ...
88     Wallsend  1.608666
89   Willoughby  1.222031
90  Wollondilly  1.836921
91   Wollongong  1.619093
92        Wyong  1.897736

[93 rows x 2 columns]

In [42]:
Children.to_csv('Clean Data/AverageChildren.csv')

## Average weekly income

for weekly income, we will perform this exactly how we performed counting average age, and use the average of each bracket times the number of respondents under it. this may be a little skewed, but it will be very very close and should result in the same error for all subjects due to the large numbers used in this, we will divide by 100 during the multiplication (ie, the average of 1-149 will be 75/100 = 0.75). additionally, to save some time typing i will be making new, shorter named brackets to count my supertotal.

due to the abysmal column names of this data i am going to manually edit our csv files to make the columns easier to use

In [43]:
Income=pd.read_csv('Unclean Data/Weekly income - Unclean.csv',thousands = ',')

In [44]:
Income['75 Bracket']=0.75*Income['75 Bracket']
Income['225 Bracket']=2.25*Income['225 Bracket']
Income['350 Bracket']=3.50*Income['350 Bracket']
Income['450 Bracket']=4.50*Income['450 Bracket']
Income['575 Bracket']=5.75*Income['575 Bracket']
Income['725 Bracket']=7.25*Income['725 Bracket']
Income['900 Bracket']=9.00*Income['900 Bracket']
Income['1125 Bracket']=11.25*Income['1125 Bracket']
Income['1375 Bracket']=13.75*Income['1375 Bracket']
Income['1625 Bracket']=16.25*Income['1625 Bracket']
Income['1875 Bracket']=18.75*Income['1875 Bracket']
Income['2500 Bracket']=25.00*Income['2500 Bracket']
Income['3000 Bracket']=30.00*Income['3000 Bracket']

In [45]:
Income['Supertotal']=Income['75 Bracket']+Income['225 Bracket']+Income['350 Bracket']+Income['450 Bracket']+Income['575 Bracket']+Income['725 Bracket']+Income['900 Bracket']+Income['1125 Bracket']+Income['1375 Bracket']+Income['1625 Bracket']+Income['1875 Bracket']+Income['2500 Bracket']+Income['3000 Bracket']

In [46]:
Income['Average']=Income['Supertotal']/Income['Total']

In [47]:
Income['Average']=Income['Average']*100

In [48]:
Income=Income.drop(['Nil income','75 Bracket','225 Bracket','350 Bracket','450 Bracket','575 Bracket','725 Bracket','900 Bracket','1125 Bracket','1375 Bracket','1625 Bracket','1875 Bracket','2500 Bracket','3000 Bracket','Total','Supertotal'],axis=1)

In [50]:
Income.drop([93,94,95], axis=0)

           Name      Average
0        Albury   787.124060
1        Auburn   690.836679
2       Ballina   789.434557
3       Balmain  1282.443970
4     Bankstown   630.460980
..          ...          ...
88     Wallsend   787.601189
89   Willoughby  1257.938572
90  Wollondilly   889.833583
91   Wollongong   755.782342
92        Wyong   746.197345

[93 rows x 2 columns]

In [51]:
Income.to_csv('Clean Data/AverageIncome.csv')

### Result data

In [56]:
Result = pd.read_csv('Unclean Data/Result data.csv')

In [57]:
Result.head()

,State,DivisionId,DivisionAb,DivisionName,TCPCandidate,PreferenceVotes,CandidateId,CandidateSurname,PartyAb
0,ACT,101,CANB,Canberra,1,71915,25470,ALP_CANB,ALP
1,ACT,101,CANB,Canberra,2,53140,25472,LP_CANB,LP
2,ACT,102,FENN,Fenner,1,72773,25478,ALP_FRAS,ALP
3,ACT,102,FENN,Fenner,2,43675,25480,LP_FRAS,LP
4,NSW,103,BANK,Banks,1,41167,27557,ALP_BANK,ALP

In [58]:
Result = Result[Result.State == 'NSW']

In [62]:
Result.index = range(len(Result))

In [63]:
Result.head()

,State,DivisionId,DivisionAb,DivisionName,TCPCandidate,PreferenceVotes,CandidateId,CandidateSurname,PartyAb
0,NSW,103,BANK,Banks,1,41167,27557,ALP_BANK,ALP
1,NSW,103,BANK,Banks,2,46050,27558,LP_BANK,LP
2,NSW,104,BART,Barton,1,44929,27565,ALP_BART,ALP
3,NSW,104,BART,Barton,2,37682,27566,LP_BART,LP
4,NSW,105,BENN,Bennelong,1,51139,27576,LP_BENN,LP

In [64]:
Result.to_csv('Clean Data/CleanResult.csv')